app/views/videos/_show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."video_id" = $1 AND "votes"."like" = $2  [["video_id", 1], ["like", "t"]]
---
      <span>
        <i class="fa fa-thumbs-o-up" aria-hidden="true"> <%= video.votes.like.size %></i>