app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`) VALUES ('thanh', '$2a$12$gFQPV1dWtFqhmCX2JtSegeyKVMgoGOC1a1aswdHXH0ym3vnEYiBVG', '2020-04-22 02:32:57', '2020-04-22 02:32:57')
---
  def create
    @user = User.new(user_params)
    if @user.save!